In [29]:
import pandas as pd
import matplotlib.pyplot as plt
import squarify

In [30]:
df_dg = pd.read_csv(r"C:\Users\kingd\Downloads\Race and Ethnicity.csv")

In [44]:
df_dg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID Race                  112 non-null    int64
 1   Race                     112 non-null    object
 2   ID Ethnicity             112 non-null    int64
 3   Ethnicity                112 non-null    object
 4   ID Year                  112 non-null    int64
 5   Year                     112 non-null    int64
 6   Hispanic Population Moe  112 non-null    float64
 7   Geography                112 non-null    object
 8   ID Geography             112 non-null    object
 9   Slug Geography           112 non-null    object
 10  Population               112 non-null    int64
 11  share                    112 non-null    float64
dtypes: float64(2), int64(5), object(5)
memory usage: 10.6+ KB

In [32]:
df_dg.isnull().sum(axis=0)

ID Race                    0
Race                       0
ID Ethnicity               0
Ethnicity                  0
ID Year                    0
Year                       0
Hispanic Population Moe    0
Geography                  0
ID Geography               0
Slug Geography             0
Population                 0
share                      0
dtype: int64

In [45]:
df_dg['Year'].value_counts()

2020    14
2019    14
2018    14
2017    14
2016    14
2015    14
2014    14
2013    14
Name: Year, dtype: int64

In [33]:
tampa_gdp = pd.read_csv(r"C:\Users\kingd\Downloads\gdp_tampa.csv")

In [34]:
tampa_gdp.head()

         DATE   NGMP45300
0  2001-01-01   80171.426
1  2002-01-01   85318.547
2  2003-01-01   91144.945
3  2004-01-01   99483.963
4  2005-01-01  107620.219

In [35]:
tampa_gdp.rename(columns={'NGMP45300': 'GDP in the Millions'}, inplace=True)
tampa_gdp['DATE'] = pd.to_datetime(tampa_gdp['DATE'])
tampa_gdp['Year'] = tampa_gdp['DATE'].dt.year
tampa_gdp.isnull().sum(axis=0)

DATE                   0
GDP in the Millions    0
Year                   0
dtype: int64

In [36]:
tampa_gdp.drop('DATE', axis=1, inplace=True)
tampa_gdp.set_index('Year', inplace=True)
tampa_gdp.head()

      GDP in the Millions
Year
2001            80171.426
2002            85318.547
2003            91144.945
2004            99483.963
2005           107620.219

In [37]:
tampa_pop = pd.read_csv(r"C:\Users\kingd\Downloads\tampa_population.csv")
tampa_pop.head()

         date   Population   Annual Change
0  12/31/1950       300000             NaN
1  12/31/1951       323000            7.67
2  12/31/1952       349000            8.05
3  12/31/1953       376000            7.74
4  12/31/1954       405000            7.71

In [38]:
tampa_pop['date'] = pd.to_datetime(tampa_pop['date'])
tampa_pop['date'] = tampa_pop['date'].dt.year
tampa_pop.isnull().sum(axis=0)

date              0
 Population       0
 Annual Change    1
dtype: int64

In [39]:
df2000pop = tampa_pop[tampa_pop['date'] >= 2000]
df2000pop = df2000pop.rename(columns={'date': 'Year'})
df2000pop.head()

    Year   Population   Annual Change
50  2000      2071000            1.87
51  2001      2106000            1.69
52  2002      2142000            1.71
53  2003      2179000            1.73
54  2004      2216000            1.70

In [40]:
tampa_housing = pd.read_csv(r"C:\Users\kingd\Downloads\tampa-housing.csv")
tampa_housing.head()

         DATE  ATNHPIUS45300Q
0  1976-04-01           40.33
1  1976-07-01           43.37
2  1976-10-01           43.64
3  1977-01-01           42.07
4  1977-04-01           44.85

In [41]:
tampa_housing.rename(columns={'ATNHPIUS45300Q': 'House Price Index'}, inplace=True)
tampa_housing['Year'] = pd.to_datetime(tampa_housing['DATE']).dt.year
tampa_housing = tampa_housing[tampa_housing['Year'] >= 2000]
tampa_housing = tampa_housing.select_dtypes(include='number').groupby('Year', as_index=False).mean()

tampa_housing.head()

   Year  House Price Index
0  2000           130.3275
1  2001           144.1175
2  2002           157.1775
3  2003           171.2350
4  2004           197.8200

In [43]:
merged_data = pd.merge(pd.merge(tampa_housing, df2000pop, on='Year'), tampa_gdp, on='Year')

merged_data.head()

   Year  House Price Index   Population   Annual Change  GDP in the Millions
0  2001           144.1175      2106000            1.69            80171.426
1  2002           157.1775      2142000            1.71            85318.547
2  2003           171.2350      2179000            1.73            91144.945
3  2004           197.8200      2216000            1.70            99483.963
4  2005           243.2450      2253000            1.67           107620.219

In [46]:
merged_data.to_excel('merged_data.xlsx', index=False)